app/views/ano_importado_csvs/index.html.slim

SELECT 1 AS one FROM "despesas" WHERE "despesas"."ano_importado_csv_id" = $1 LIMIT $2  [["ano_importado_csv_id", 16], ["LIMIT", 1]]
---

					- if ano_importado_csv.processado == true && ::Despesa.where(ano_importado_csv_id: ano_importado_csv.id).any?