app/controllers/ano_importado_csvs_controller.rb

SELECT "ano_importado_csvs".* FROM "ano_importado_csvs"
---
  def index
    @ano_importado_csvs = AnoImportadoCsv.all

INSERT INTO "ano_importado_csvs" ("processado", "file_file_name", "file_content_type", "file_file_size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["processado", nil], ["file_file_name", nil], ["file_content_type", nil], ["file_file_size", nil], ["created_at", "2022-10-27 15:51:31.326856"], ["updated_at", "2022-10-27 15:51:31.326856"]]
---
  def create
    @ano_importado_csv = AnoImportadoCsv.new(ano_importado_csv_params)

    respond_to do |format|
      if @ano_importado_csv.save

UPDATE "ano_importado_csvs" SET "updated_at" = $1 WHERE "ano_importado_csvs"."id" = $2  [["updated_at", "2022-10-27 22:01:57.918257"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @ano_importado_csv.update(ano_importado_csv_params)

DELETE FROM "ano_importado_csvs" WHERE "ano_importado_csvs"."id" = $1  [["id", 1]]
---
  def destroy
    @ano_importado_csv.destroy

UPDATE "ano_importado_csvs" SET "processado" = $1, "updated_at" = $2 WHERE "ano_importado_csvs"."id" = $3  [["processado", true], ["updated_at", "2022-10-28 12:39:56.024622"], ["id", 8]]
---
  def processar
    @ano_importado_csv.transaction do
      begin
        @ano_importado_csv.processar_csv

        if @ano_importado_csv.save && @ano_importado_csv.processado == true

SELECT "ano_importado_csvs".* FROM "ano_importado_csvs" WHERE "ano_importado_csvs"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_ano_importado_csv
      @ano_importado_csv = AnoImportadoCsv.find(params[:id])