app/controllers/despesas_controller.rb

SELECT "despesas".* FROM "despesas"
---
	def index
		@despesas = Despesa.all

SELECT "despesas".* FROM "despesas" WHERE "despesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
		def set_despesa
			@despesa = Despesa.find(params[:id])