app/models/ano_importado_csv.rb

UPDATE "ano_importado_csvs" SET "processado" = $1, "updated_at" = $2 WHERE "ano_importado_csvs"."id" = $3  [["processado", true], ["updated_at", "2022-10-28 12:39:56.024622"], ["id", 8]]
---
		end

		self.processado = true
		self.save